---
title: SolidGlass
classe: Autodesk.Revit.DB.Visual.SolidGlass
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# SolidGlass

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `SolidGlass.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `SolidGlass.CommonTintToggle` | String |
| `String SolidglassBumpAmount { get; }` | `SolidGlass.SolidglassBumpAmount` | String |
| `String SolidglassBumpEnable { get; }` | `SolidGlass.SolidglassBumpEnable` | String |
| `String SolidglassBumpMap { get; }` | `SolidGlass.SolidglassBumpMap` | String |
| `String SolidglassColorByObject { get; }` | `SolidGlass.SolidglassColorByObject` | String |
| `String SolidglassGlossiness { get; }` | `SolidGlass.SolidglassGlossiness` | String |
| `String SolidglassReflectance { get; }` | `SolidGlass.SolidglassReflectance` | String |
| `String SolidglassRefractionIor { get; }` | `SolidGlass.SolidglassRefractionIor` | String |
| `String SolidglassTransmittance { get; }` | `SolidGlass.SolidglassTransmittance` | String |
| `String SolidglassTransmittanceCustomColor { get; }` | `SolidGlass.SolidglassTransmittanceCustomColor` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```